import random
answers = ["Бесспорно", "Мне кажется - да", "Пока неясно, попробуй снова", "Даже не думай",
           "Предрешено", "Вероятнее всего", "Спроси позже", "Мой ответ - нет",
           "Никаких сомнений", "Хорошие перспективы", "Лучше не рассказывать", "По моим данным - нет",
           "Можешь быть уверен в этом", "Да", "Сконцентрируйся и спроси опять", "Весьма сомнительно"]
def choice():
    print(answers[n])

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print("Как вас зовут? ")
name = input()
print('Здравствуйте, ' + name + '! ')

flag = True
while flag:
    
    print("Задайте вопрос по типу да\нет")
    n = random.randrange(len(answers))
    k = input()
    choice()
    print("Выхотите задать еще вопрос? Пришлите +, если да")
    f = input()
    if f == "+":
        continue
    print('Возвращайся если возникнут вопросы!')
    flag = False
